v7/simpleFoam/0/_unused/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet
  
    {
        type            fixedValue;
        value           $internalField;
    }
 



    outlet
    {
        type            zeroGradient;
    }



    upperWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    lowerWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    back
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    front
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    left
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
